# Breaking it into steps with Subqueries

### Introduction

In this lesson, we'll learn about writing subqueries.  With subqueries, we can create temporary tables that we can then reference later in our query.  Let's see this by way of example.

### Loading our Data

First, let's use sqlite to connect to a new database by running the following:

In [1]:
import sqlite3
conn = sqlite3.connect('schools.db')

And then let's load into data regarding various schools tuitions and salary potential, and create the related tables.

In [2]:
import pandas as pd
tuitions_df = pd.read_csv('https://raw.githubusercontent.com/data-eng-10-21/sql-subqueries/main/school_prices/tuition_income.csv')
tuitions_df.to_sql('tuitions', conn, if_exists = 'replace')

In [3]:
salary_potential_df = pd.read_csv('https://raw.githubusercontent.com/data-eng-10-21/sql-subqueries/main/school_prices/salary_potential.csv')
salary_potential_df.to_sql('salaries', conn, if_exists = 'replace')

### Exploring our Data

So in our schools database, we now have both salary and tuition data for various colleges.  Let's start by looking at some of the salary data.

In [5]:
df = pd.read_sql("SELECT * FROM salaries ORDER BY name ASC", conn)

df[:3]

,index,rank,name,state_name,early_career_pay,mid_career_pay,make_world_better_percent,stem_percent
0,94,16,Adams State University,Colorado,44400,81400,56.0,3
1,136,14,Adventist University of Health Sciences,Florida,51600,89800,88.0,5
2,161,14,Agnes Scott College,Georgia,46000,83600,57.0,26

> So we can see that we have each university, as well as the average `early_career_pay` and `mid_career_pay` among graduates, among other columns.

Next, let's take a look at some of the tuition data.

In [6]:
df = pd.read_sql("SELECT * FROM tuitions ORDER BY name ASC", conn)

df[:3]

,index,name,state,total_price,year,campus,net_cost,income_lvl
0,181033,AI Miami International University of Art and D...,FL,33319,2011,On Campus,23774.0,"0 to 30,000"
1,181034,AI Miami International University of Art and D...,FL,33319,2011,On Campus,24365.0,"30,001 to 48,000"
2,181035,AI Miami International University of Art and D...,FL,33319,2011,On Campus,27254.0,"48_001 to 75,000"

> Here we can see that total price, as well as the average net cost (which likely takes into account scholarship information).

### Setting up the problem

Now one thing we may notice is that there are multiple rows for the same school, for the same year.  For example, above we see that Al Miami has multiple rows for 2011, expressing the net cost for different income brackets for that year.

Let's say that we want to get an average total_price of each school per year, and then find the most recent average tuition for each school.  

We can do so in two steps.  First we can calculate the average tuition per year by grouping our data by school name and year.

In [12]:
df = pd.read_sql("""SELECT name, state, avg(total_price) as avg_total_price, year 
FROM tuitions
GROUP BY name, year""", conn)

In [20]:
df[:5]

,name,state,avg_total_price,year
0,AI Miami International University of Art and D...,FL,37464.0,2010
1,AI Miami International University of Art and D...,FL,32231.5,2011
2,AI Miami International University of Art and D...,FL,32457.5,2012
3,AI Miami International University of Art and D...,FL,32689.0,2013
4,AI Miami International University of Art and D...,FL,32584.0,2014

Happy that we now only one row per school, per year, we can save this as a new table.

In [15]:
df.to_sql('school_grouped_tuitions', conn, if_exists = 'replace')

And then we can query that table to find the most recent average tuition for each school.

In [17]:
pd.read_sql("""SELECT name, avg_total_price, max(year) as year 
                 FROM school_grouped_tuitions GROUP BY name""", conn)[:2]

                                                name  avg_total_price  year
0  AI Miami International University of Art and D...          33326.0  2017
1                                        ASA College          35526.0  2018

Now above, we performed this in two steps, by first calculating the average cost per school, per year in a table called `school_grouped_tuitions`.  We then referenced that table to find the average_price for the most recent school school per year.  It turns out that with subqueries we can perform each of these steps in a single statement.  Here's how.

### Writing Subqueries

We again start with the query that groups by our tuition data by name and year.

```sql
SELECT * FROM tuitions GROUP BY name, year
```

In [21]:
tuitions_df = pd.read_sql("""SELECT name, state,
avg(total_price) as avg_total_price, year 
FROM tuitions
GROUP BY name, year""", conn)
tuitions_df[:2]

,name,state,avg_total_price,year
0,AI Miami International University of Art and D...,FL,37464.0,2010
1,AI Miami International University of Art and D...,FL,32231.5,2011

And we can then reference these results by first wrapping the query in parentheses, using the `as` keyword to assign an alias, and then referencing that subquery.

```sql
SELECT * FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
```

In [22]:
tuitions_df = pd.read_sql("""
SELECT * FROM (SELECT name, state,
avg(total_price) as avg_total_price, year 
FROM tuitions
GROUP BY name, year)
""", conn)

tuitions_df[:2]

,name,state,avg_total_price,year
0,AI Miami International University of Art and D...,FL,37464.0,2010
1,AI Miami International University of Art and D...,FL,32231.5,2011

So notice in the above, we reference the result of the subquery as if it were a table itself.  

Now in the query above, we simply return all of the results of the subquery.  But this time, let's use the derived table to return only the most recent year avg_total_price per school.

In [26]:
sql = """SELECT name, avg_total_price, max(year) as year 
          FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name
"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                                name  avg_total_price  year
0  AI Miami International University of Art and D...          33326.0  2017
1                                        ASA College          35526.0  2018

Let's see this in cleaner syntax.

```sql 
SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name
```

So in the outer SELECT statement we select from the subquery -- or the derived table.  Notice also that the subquery itself is a valid select statement.

Finally, recognize that in the outer query we selected the `avg_total_price` column, which was created as an alias in our subquery.  So the point is that we really can treat the inner subquery just as a derived table.

### Subqueries all the way down

Remember that our pattern for using a subquery is simply to write a select statement and wrap it in parentheses and assign an alias.

```sql 
(SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions
```

If want, we can also turn our query above into a subquery by following the same pattern:

> So we start with the following query:

```sql
SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name
```

And then turn it into a subquery by wrapping the whole thing in parentheses and specifying an alias.

```sql
SELECT * FROM 
        (SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name) as tuitions
```

Below we show the result.

In [27]:
sql = """SELECT * FROM 
        (SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name) as tuitions"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                                name  avg_total_price  year
0  AI Miami International University of Art and D...          33326.0  2017
1                                        ASA College          35526.0  2018

### Summary

Subqueries allow us to create to treat the result of a SELECT statement as a derived table.  Doing so allows us to break our SQL calculations into steps.

Above, we started with our select statement of:

```sql
SELECT name, state, avg(total_price) as avg_total_price, year  FROM tuitions GROUP BY name, year
```
And then turned it into a subquery by wrapping it in parentheses and setting the result to an alias.  Notice that the outer query is now selecting from the result of the subquery, `school_grouped_tuitions`.

```sql
SELECT name, state, avg(total_price) as avg_total_price, year FROM (SELECT * FROM tuitions GROUP BY name, year) as school_grouped_tuitions;
```

In [29]:
tuitions_df = pd.read_sql("""
SELECT * FROM (
 SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tutions
""", conn)

tuitions_df[:2]

,name,state,avg_total_price,year
0,AI Miami International University of Art and D...,FL,37464.0,2010
1,AI Miami International University of Art and D...,FL,32231.5,2011

And then we further grouped these results so we only see the most recent record per year.

```sql
SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name
```

In [30]:
sql = """SELECT name, avg_total_price, max(year) as year FROM
               (SELECT name, state, avg(total_price) as avg_total_price, year 
                FROM tuitions
                GROUP BY name, year) as school_grouped_tuitions
          GROUP BY name"""

tuitions_df = pd.read_sql(sql, conn)
tuitions_df[:2]

                                                name  avg_total_price  year
0  AI Miami International University of Art and D...          33326.0  2017
1                                        ASA College          35526.0  2018